### Data Cleaning File

In [10]:
# importing the necessary pandas and matplotlib libraries

import pandas as pd
import matplotlib as plt

### Importing the data into the Jupyter Notebook
The canvas reccomends that I start with these datasets:
- imdb.title.basics
- imdb.title.ratings
- bom.movie_gross

In [20]:
# loading imdb.title.basics dataset & setting it to the variable 'imdb'
imdb = pd.read_csv('zippedData/imdb.title.basics.csv.gz')

# loading imdb.title.ratings dataset & setting it to the variable 'imdb_ratings'
imdb_ratings = pd.read_csv('zippedData/imdb.title.ratings.csv.gz')

# loading bom.movie_gross dataset & setting it to the variable 'bom_gross'
bom_gross = pd.read_csv('zippedData/bom.movie_gross.csv.gz')

# loading tmdb.movies dataset & setting it to the variable 'movie_db'
movie_db = pd.read_csv('zippedData/tmdb.movies.csv.gz')

# loading tn.movie_budgets dataset & setting it to the variable 'movie_budgets'
movie_budgets = pd.read_csv('zippedData/tn.movie_budgets.csv.gz')

### imdb (imdb.title.basics)

In [12]:
# viewing first 5 rows of imdb.title.basics
imdb.head()

,tconst,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"

In [13]:
# checking how many rows & columns are in imdb.title.basics
imdb.shape

(146144, 6)

In [25]:
imdb.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 146144 entries, 0 to 146143
Data columns (total 6 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   tconst           146144 non-null  object
 1   primary_title    146144 non-null  object
 2   original_title   146123 non-null  object
 3   start_year       146144 non-null  int64
 4   runtime_minutes  114405 non-null  float64
 5   genres           140736 non-null  object
dtypes: float64(1), int64(1), object(4)
memory usage: 6.7+ MB

### imdb_ratings (imdb.title.ratings)

In [14]:
# viewing first 5 rows of imdb.title.ratings
imdb_ratings.head()

       tconst  averagerating  numvotes
0  tt10356526            8.3        31
1  tt10384606            8.9       559
2   tt1042974            6.4        20
3   tt1043726            4.2     50352
4   tt1060240            6.5        21

In [15]:
# checking how many rows & columns are in imdb.title.ratings
imdb_ratings.shape

(73856, 3)

### bom_gross (bom.movie_gross)

In [16]:
# viewing first 5 rows of bom.movie_gross
bom_gross.head()

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010

In [17]:
# checking how many rows & columns are in bom.movie_gross
bom_gross.shape

(3387, 5)

### movie_db (tmdb.movies)

In [21]:
# viewing first 5 rows of tmdb.movies

movie_db.head()

,Unnamed: 0,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count
0,0,"[12, 14, 10751]",12444,en,Harry Potter and the Deathly Hallows: Part 1,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788
1,1,"[14, 12, 16, 10751]",10191,en,How to Train Your Dragon,28.734,2010-03-26,How to Train Your Dragon,7.7,7610
2,2,"[12, 28, 878]",10138,en,Iron Man 2,28.515,2010-05-07,Iron Man 2,6.8,12368
3,3,"[16, 35, 10751]",862,en,Toy Story,28.005,1995-11-22,Toy Story,7.9,10174
4,4,"[28, 878, 12]",27205,en,Inception,27.920,2010-07-16,Inception,8.3,22186

In [22]:
movie_db.shape

(26517, 10)

### movie_budgets (tn.movie_budgets)

In [26]:
# viewing first 5 rows of tn.movie_budgets
movie_budgets.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"

In [24]:
movie_budgets.shape

(5782, 6)